lib/erlang/test/benchmarks/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="app.beehive.com" port="8080" type="tcp"></server>
  <server host="streaming.beehive.com" port="8080" type="tcp"></server>
</servers>

  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
  <arrivalphase phase="1" duration="5" unit="minute">
    <users interarrival="1" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="2" duration="30" unit="second">
    <users interarrival="0.125" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="3" duration="5" unit="minute">
    <users interarrival="1" unit="second"></users>
  </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="20">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_6_1; en-us) AppleWebKit/531.9 (KHTML, like Gecko) Version/4.0.3 Safari/531.9</user_agent>
    <user_agent probability="20">Mozilla/5.0 (iPhone; U; CPU iPhone OS 2_2_1 like Mac OS X; en-us) AppleWebKit/525.18.1 (KHTML, like Gecko) Version/3.1.1 Mobile/5H11 Safari/525.20</user_agent>
    <user_agent probability="20">Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0)</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="router" probability="100" type="ts_http">

    <thinktime value="10" random="true"></thinktime>
    <request><http url='/not_a_route' version="1.1" ></http></request>
    <request><http url='/hi' version="1.1" ></http></request>
  </session>
  
 </sessions>
</tsung>